In [1]:
import pandas as pd
import numpy as np

### Pandas Head
Pandas Head is pretty straight forward: It's a great way to view the first N rows of your DataFrame. Let's check out how to use .head() and a few other ways to pull rows from your DataFrame: .tail() and .sample()

Examples:
1. Pandas Head - Default on DataFrame + Series
2. Pandas Head - Custom N Rows
3. Pulling Rows from your DataFrame: .tail() and [.sample()](https://dataindependent.com/pandas/pandas-sample/)

But first, let's create a tall DataFrame

In [2]:
np.random.seed(seed=42)

num_students = 1000

df = pd.DataFrame(data=np.random.randint(0,10,(num_students,3)),
                  columns=('Score1', 'Score2', 'Score3'),
                 index=["Student{}".format(x) for x in range(1, num_students+1)])

print ("Your DataFrame is {:,} rows long".format(len(df)))

Your DataFrame is 1,000 rows long

### 1. Pandas Head - Default

Let's check out the top rows of our dataset. In order to do this we need to call .head() on our DataFrame. You can do this both on a DataFrame and a Series.

Notice how Pandas will return 5 rows with .head() by default.

In [3]:
df.head()

          Score1  Score2  Score3
Student1       6       3       7
Student2       4       6       9
Student3       2       6       7
Student4       4       3       7
Student5       7       2       5

In [4]:
df['Score2'].head()

Student1    3
Student2    6
Student3    6
Student4    3
Student5    2
Name: Score2, dtype: int64

### 2. Pandas Head - Custom N Rows

If you wanted to see the first N rows of your DataFrame then all you need to do is pass in an integer into .head().

Here I want to see the first 3 rows of my DataFrame. You can either specify n=3, or simply pass in 3.

In [5]:
df.head(n=3)

          Score1  Score2  Score3
Student1       6       3       7
Student2       4       6       9
Student3       2       6       7

In [6]:
df.head(3)

          Score1  Score2  Score3
Student1       6       3       7
Student2       4       6       9
Student3       2       6       7

### 3. Pulling Rows from your DataFrame: .tail() and [.sample()](https://dataindependent.com/pandas/pandas-sample/)

Say you didn't want to see the first top rows, but you wanted to see the bottom rows, or even a random sample of rows. This is where .tail() and [.sample()](https://dataindependent.com/pandas/pandas-sample/) come in.

.tail() will show you the 'tail' (or bottom rows) of your dataset

In [7]:
df.tail()

             Score1  Score2  Score3
Student996        5       2       7
Student997        1       0       8
Student998        2       0       6
Student999        9       4       4
Student1000       0       8       6

In [8]:
df.tail(2)

             Score1  Score2  Score3
Student999        9       4       4
Student1000       0       8       6

[.sample()](https://dataindependent.com/pandas/pandas-sample/) will return a random sample of rows. By default you'll only get 1 sample, but you can also specify N rows.

In [9]:
df.sample()

            Score1  Score2  Score3
Student152       0       7       9

In [10]:
df.sample(3)

            Score1  Score2  Score3
Student936       3       6       8
Student910       4       7       9
Student984       0       3       1